kamadak/vboxtime-netbsd/vboxtime.4
.\" $NetBSD$
.\"
.\" Copyright (c) 2014 KAMADA Ken'ichi.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd November 8, 2014
.Dt VBOXTIME 4
.Os
.\" ----------------------------------------------------------------
.Sh NAME
.Nm vboxtime
.Nd VirtualBox time synchronization driver
.\" ----------------------------------------------------------------
.Sh SYNOPSIS
.Cd "vboxtime* at pci? dev ? function ?"
.\" ----------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
driver periodically synchronize the guest kernel clock
with the VirtualBox host.
.Pp
The
.Nm
driver synchronizes the time every one minute.
The time is stepped if the offset is larger than 5 seconds,
and the clock speed is adjusted otherwise.
.\" ----------------------------------------------------------------
.Sh AUTHORS
The
.Nm
driver was written by
.An "KAMADA Ken'ichi" .
.\"
.\" EOF
